jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
/**
  ******************************************************************************
  * @file    sfu_boot.c
  * @author  MCD Application Team
  * @brief   SFU BOOT module
  *          This file provides firmware functions to manage the following
  *          functionalities of the Secure Boot:
  *           + Initialization and de-initialization functions
  *           + Secure Boot Control functions
  *           + Secure Boot State functions
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2017 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under Ultimate Liberty license
  * SLA0044, the "License"; You may not use this file except in compliance with
  * the License. You may obtain a copy of the License at:
  *                             www.st.com/SLA0044
  *
  ******************************************************************************
  */

#define SFU_BOOT_C

/* Includes ------------------------------------------------------------------*/
#include "string.h"
#include "sfu_boot.h"
#include "sfu_loader.h"
#include "sfu_low_level_security.h"
#include "sfu_low_level_flash.h"
#include "sfu_low_level.h"
#include "sfu_fsm_states.h"
#include "sfu_error.h"
#include "stm32l4xx_it.h" /* required for the HAL Cube callbacks */

/*
 * The sfu_com init is provided by the sfu_com_trace module by default.
 * If not, then it is taken from the sfu_com_loader module.
 */
#if defined(SFU_DEBUG_MODE)
#include "sfu_trace.h"
#else
#include "sfu_trace.h"      /* needed anyhow even if the defines will be empty */
#include "sfu_com_loader.h" /* needed only for the COM init/de-init */
#endif /* SFU_DEBUG_MODE */
#include "se_def.h"
#include "se_bootinfo.h"
#include "se_interface_bootloader.h"  /* sfu_boot is the bootloader core part */
#include "sfu_new_image.h"            /* the local loader is a kind of "application" running in SB_SFU so it needs the
                                         services to install a FW image */
#include "sfu_fwimg_services.h"       /* sfu_boot uses the services of the FWIMG module */
#include "sfu_test.h"                 /* auto tests */

#ifdef KMS_ENABLED
#include "kms.h"
#include "sfu_kms.h"
#include "pkcs11.h"
#include "se_interface_kms.h"
#endif /* KMS_ENABLED */

#ifdef ENABLE_IMAGE_STATE_HANDLING
#include "sfu_fwimg_services.h"
#endif /* ENABLE_IMAGE_STATE_HANDLING */

/** @addtogroup SFU Secure Boot / Secure Firmware Update
  * @{
  */
extern uint8_t gRollbackDone; /* indicates if a rollback has been performed : see sfu_fwimg_services.c */

/** @addtogroup SFU_CORE SBSFU Application
  * @{
  */

/** @defgroup SFU_BOOT SB Secure Boot
  * @brief This file provides a set of firmware functions to manage the Secure Boot state machine.
  *      It will go through all the Secure Boot and the Secure Fw Update states without compromising
  *        the Root of Trust.
  * @{
  */


/** @defgroup SFU_BOOT_Private_Defines Private Defines
  * @{
  */

/**
  * @defgroup SFU_BOOT_Private_Defines_Execution_Id Execution ID
  * @brief Identifier for Running Code (Secure Boot or User Application)
  * @{
  */
#define EXEC_ID_SECURE_BOOT     0U       /*!< ID for Secure Boot */
#define EXEC_ID_USER_APP        1U       /*!< ID for User App */
#define IS_VALID_EXEC_ID(EXEC_ID)        (((EXEC_ID) == EXEC_ID_SECURE_BOOT) || \
                                          ((EXEC_ID) == EXEC_ID_USER_APP)) /*!< Check for valid ID */
/**
  * @}
  */

#define RESERVED_VALUE (0xFE) /*!< Reserved value. The reserved field used inside the LastExecStatus of the BootInfo is
                                   maintained for future customization/expansion of the field itself */
#define AES_BLOCK_SIZE (16U)  /*!< Size of an AES block to check FW image alignment */

/**
  * @}
  */

/** @defgroup SFU_BOOT_Private_Macros Private Macros
  * @{
  */
#define SFU_SET_SM_IF_CURR_STATE(Status, SM_STATE_OK, SM_STATE_FAILURE) \
  do{                                                                     \
    m_StateMachineContext.PrevState = m_StateMachineContext.CurrState;    \
    if (Status == SFU_SUCCESS){                                                        \
      m_StateMachineContext.CurrState = SM_STATE_OK;                    \
    }                                                                   \
    else {                                                              \
      m_StateMachineContext.CurrState = SM_STATE_FAILURE;               \
    }                                                                   \
  }while(0) /*!< Set a State Machine state according to the 'Status' value*/


#define SFU_SET_SM_CURR_STATE(NewState)                               \
  do{                                                                   \
    m_StateMachineContext.PrevState = m_StateMachineContext.CurrState;  \
    m_StateMachineContext.CurrState = NewState;                       \
  }while(0) /*!< Set a State Machine state*/


/**
  * @defgroup SFU_BOOT_Private_Macros_Execution_Status Execution Status
  * @brief Execution State helper functions for SB State Machine
  * @{
  */
#define SFU_GET_LAST_EXEC_STATE(STATUS)         (((STATUS)>>8U) & 0xFFU)          /*!< Get last State Machine state*/
#define SFU_GET_LAST_EXEC_IMAGE_ID(STATUS)      (((STATUS)>>16U) & 0xFFU)         /*!< Get image ID*/
#define SFU_GET_LAST_EXEC_ID(STATUS)            (((STATUS)>>24U)  & 0xFFU)        /*!< Get Execution ID*/
#define SFU_SET_LAST_EXEC_STATUS(STATE,IMAGE_ID,EXEC_ID)  (RESERVED_VALUE | ((STATE) << 8U) | ((IMAGE_ID) << 16U) \
                                                           | ((EXEC_ID) << 24U))  /*!< Set a State Machine state*/
/**
  * @}
  */


/**
  * @}
  */

/** @defgroup SFU_BOOT_Private_Variables Private Variables
  * @brief variables used by sfu_boot.c only (static).
  * @{
  */

