jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
#define SFU_STATE_INITIAL     SFU_STATE_CHECK_STATUS_ON_RESET  /*!< Define the initial state*/

typedef struct
{
  SFU_BOOT_StateMachineTypeDef  PrevState;      /*!< The previous state of the State Machine */
  SFU_BOOT_StateMachineTypeDef  CurrState;      /*!< The current state of the State Machine */
} SFU_BOOT_StateMachineContextTypeDef;          /*!< Specifies a structure containing the State Machine context
                                                     information using during the SM evolution. */


/*!< Static member variables representing the StateMachine context used during the StateMachine evolution. */
static __IO SFU_BOOT_StateMachineContextTypeDef m_StateMachineContext = {SFU_STATE_INITIAL,
                                                                         SFU_STATE_INITIAL
                                                                        };
/**
  * @}
  */

/** @defgroup SFU_BOOT_Private_Functions Private Functions
  * @brief Functions used internally by sfu_boot.c
  *        All these functions should be declared as static.
  * @{
  */

/** @defgroup SFU_BOOT_Initialization_Functions Initialization Functions
  * @brief Bootloader Init/Deinit functions and BSP configuration.
  * @{
  */

static SFU_ErrorStatus SFU_BOOT_Init(void);
static SFU_ErrorStatus SFU_BOOT_DeInit(void);
static void SFU_BOOT_BspConfiguration(void);

/**
  * @}
  */

/** @defgroup SFU_BOOT_SM_Functions State Machine Functions
  * @brief The bootloader is implemented as a Finite State Machine.
  * @{
  */
static SFU_ErrorStatus SFU_BOOT_SM_Run(void);
static void SFU_BOOT_SM_CheckStatusOnReset(void);
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
static void SFU_BOOT_SM_CheckNewFwToDownload(void);
static void SFU_BOOT_SM_DownloadNewUserFw(void);
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */
#ifdef KMS_ENABLED
static void SFU_BOOT_SM_CheckKMSBlobToInstall(void);
static void SFU_BOOT_SM_InstallKMSBlob(void);
#endif /* KMS_ENABLED */
static void SFU_BOOT_SM_CheckUserFwStatus(void);
static void SFU_BOOT_SM_VerifyUserFwSignature(void);
static void SFU_BOOT_SM_ExecuteUserFw(void);
static void SFU_BOOT_SM_HandleCriticalFailure(void);
static void SFU_BOOT_SM_RebootStateMachine(void);
static void SFU_BOOT_SM_InstallNewUserFw(void);
static void SFU_BOOT_SM_ResumeInstallNewUserFw(void);


/**
  * @brief  Initialize the State Machine:
  * @note: Functions listed in the array and @ref SFU_BOOT_State_Machine_Structure_definition must be in sync!
  */
void (* fnStateMachineTable[])(void) = {SFU_BOOT_SM_CheckStatusOnReset,
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
                                        SFU_BOOT_SM_CheckNewFwToDownload,
                                        SFU_BOOT_SM_DownloadNewUserFw,
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */
#ifdef KMS_ENABLED
                                        SFU_BOOT_SM_CheckKMSBlobToInstall,
                                        SFU_BOOT_SM_InstallKMSBlob,
#endif /* KMS_ENABLED */
                                        SFU_BOOT_SM_CheckUserFwStatus,
                                        SFU_BOOT_SM_InstallNewUserFw,
                                        SFU_BOOT_SM_VerifyUserFwSignature,
                                        SFU_BOOT_SM_ExecuteUserFw,
                                        SFU_BOOT_SM_ResumeInstallNewUserFw,
                                        SFU_BOOT_SM_HandleCriticalFailure,
                                        SFU_BOOT_SM_RebootStateMachine
                                       };


/**
  * @}
  */

/** @defgroup SFU_BOOT_Security_Functions Security Functions
  * @brief Functions handling the security protections.
  * @{
  */
static SFU_ErrorStatus SFU_BOOT_SystemSecurity_Config(void);
static SFU_ErrorStatus SFU_BOOT_CheckApplySecurityProtections(void);
static SFU_ErrorStatus SFU_BOOT_SecuritySafetyCheck(void);
/**
  * @}
  */

/** @defgroup SFU_BOOT_ExecStatus_Functions Execution Status Functions
  * @brief Functions dealing with the execution status.
  * @{
  */
static SFU_ErrorStatus SFU_BOOT_SetLastExecStatus(uint8_t uExecID, uint8_t uLastExecState);
static SFU_ErrorStatus SFU_BOOT_ManageLastExecStatus(uint32_t uLastExecStatus);
static SFU_ErrorStatus SFU_BOOT_ManageResetSources(void);

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup SFU_BOOT_EntryPoint_Function Bootloader Entry Point
  * @brief This function is the entry point of the secure bootloader service.
  * @{
  */

/**
  * @brief This function starts the secure boot service and returns only if a configuration issue occurs.
  *        In the nominal case, the bootloader service runs until the user application is launched.
  *        When no valid user application can be run (after installing a new image or not),
  *        if the local loader feature is not enabled then the execution stops,
  *        otherwise a local download will be awaited.
  *        If the state machine encounters a major issue then a reboot is triggered.
  * @param None.
  * @note Please note that this service initializes all the required sub-services and rely on them to perform its tasks.
  * @note Constraints
  *       1. The system initialization must be completed (HAL, clocks, peripherals...) before calling this function.
  *       2. This function also takes care of BSP initialization after enabling the secure mode.
  *          The BSP init code can be added in @ref SFU_BOOT_BspConfiguration().
  *       3. No other entity should handle the initialization of the Secure Engine.
  *       4. The other SB_SFU services should NOT be configured by other entities if this service is used (the previous
  *          configurations will be overwritten).
  *       5. The other SB_SFU services should NOT be used by any other entity if this service is running.
  *       6. When returning from this function a reboot should be triggered (NVIC_SystemReset) after processing the
  *          error cause.
  *       7. The caller must be prepared to never get the hand back after calling this function (jumping in user
  *          application by default or entering local loader state if local loader is enabled or rebooting to install a
  *          new image).
  * @note Settings are handled at compilation time:
  *       1. See compiler switches in main.h for secure IPs settings
  *       2. The trace system is configured in the sfu_trace.h file
  * @retval SFU_BOOT_InitErrorTypeDef error code as the function returns only if a critical failure occurs at init
  *          stage.
  */
SFU_BOOT_InitErrorTypeDef SFU_BOOT_RunSecureBootService()
{
  SFU_BOOT_InitErrorTypeDef e_ret_code = SFU_BOOT_INIT_ERROR;

