jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || defined(SFU_DEBUG_MODE)
  if (SFU_COM_DeInit() != SFU_SUCCESS)
  {
    return SFU_ERROR;
  }
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || defined(SFU_DEBUG_MODE) */

  if (SFU_LL_DeInit() != SFU_SUCCESS)
  {
    return SFU_ERROR;
  }

  /* Call the image handling De-Init  */
  if (SFU_IMG_ShutdownImageHandling() != SFU_SUCCESS)
  {
    return SFU_ERROR;
  } /* else continue */

  return SFU_SUCCESS;
}

/**
  * @brief  BSP Initialization.
  *         Called when the secure mode is enabled.
  * @note   The BSP configuration should be handled only in this function.
  * @param  None
  * @retval None
  */
static void SFU_BOOT_BspConfiguration()
{
  /* LED Init*/
  BSP_LED_Init(SFU_STATUS_LED);

#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
  /* User Button */
  BUTTON_INIT();
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */
}


/**
  * @}
  */



/** @addtogroup SFU_BOOT_SM_Functions
  * @{
  */

/**
  * @brief  Execute the Secure Boot state machine.
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
static SFU_ErrorStatus SFU_BOOT_SM_Run(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_SUCCESS;
  void (*fnStateMachineFunction)(void);


  /* Start the State Machine loop/evolution */
  while (e_ret_status == SFU_SUCCESS)
  {
    /* Always execute a security/safety check before moving to the next state */
    if (SFU_BOOT_SecuritySafetyCheck() == SFU_SUCCESS)
    {
      /*
       * Except for the 1st state, used to check the last saved execution status,
       * let's save the current Execution Status in order to be retrieved and analyzed
       * in case a reboot will be triggered by an error, bug, power-off, Hw reset, etc.
       */
      if (m_StateMachineContext.CurrState != SFU_STATE_CHECK_STATUS_ON_RESET)
      {
        SFU_BOOT_SetLastExecStatus(EXEC_ID_SECURE_BOOT, m_StateMachineContext.CurrState);
      }

      /* Get the right StateMachine function according to the current state */
      fnStateMachineFunction = fnStateMachineTable[m_StateMachineContext.CurrState];

      /* Call the State Machine function associated to the current state */
      fnStateMachineFunction();
    }
    else
    {
      e_ret_status = SFU_ERROR;
    }
  }
  /* If the State Machine cannot evolve anymore, reboot is the only option */
  if (e_ret_status != SFU_SUCCESS)
  {
    /* Set the error before forcing a reboot */
    (void)SFU_BOOT_SetLastExecError(SFU_EXCPT_UNKNOWN);

    /* This is the last operation executed. Force a System Reset */
    SFU_BOOT_ForceReboot();
  }

  return e_ret_status;
}



/** @brief  Check the Reset status in order to understand the last cause of Reset
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_CheckStatusOnReset(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  SE_StatusTypeDef         e_se_status;
  SE_BootInfoTypeDef       x_boot_info;
  uint32_t                 u_last_exec_status;

  TRACE("\r\n= [SBOOT] STATE: CHECK STATUS ON RESET");

  /* First of all, locally get the last execution status we'll work on, before setting the new state */
  if (SE_INFO_ReadBootInfo(&e_se_status, &x_boot_info) == SE_SUCCESS)
  {
    u_last_exec_status = x_boot_info.LastExecStatus;

    /*
     * Try to save here the current Execution Status in order to be retrieved and analyzed in case a reboot will be
     * triggered by an error, bug, power-off, Hw reset, etc.
     */

    if (SFU_BOOT_SetLastExecStatus(EXEC_ID_SECURE_BOOT, m_StateMachineContext.CurrState) == SFU_SUCCESS)
    {
      /* Check the wakeup sources */
      if (SFU_BOOT_ManageResetSources() == SFU_SUCCESS)
      {
        /* Check the last execution status and take the opportune actions */
        if (SFU_BOOT_ManageLastExecStatus(u_last_exec_status) == SFU_SUCCESS)
        {
          if (SE_INFO_ReadBootInfo(&e_se_status, &x_boot_info) == SE_SUCCESS)
          {
            e_ret_status = SFU_SUCCESS;
          } /* else SE_INFO_ReadBootInfo fails: go forward as we end up with a critical failure anyway */
        } /* else SFU_BOOT_ManageLastExecStatus fails: go forward as we end up with a critical failure anyway */
      } /* else SFU_BOOT_ManageResetSources fails: go forward as we end up with a critical failure anyway */
    } /* else SFU_BOOT_SetLastExecStatus fails: go forward as we end up with a critical failure anyway */
  } /* else SE_INFO_ReadBootInfo fails: go forward as we end up with a critical failure anyway */

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
  /* When the local loader feature is supported we need to check if a local download is requested */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_CHECK_NEW_FW_TO_DOWNLOAD, SFU_STATE_HANDLE_CRITICAL_FAILURE);
#else
#ifdef KMS_ENABLED
  /* When the local loader feature is disabled go directly to the check of the KMS blob presence */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_CHECK_KMS_BLOB_TO_INSTALL, SFU_STATE_HANDLE_CRITICAL_FAILURE);
#else
  /* When the local loader feature is disabled go directly to the check of the FW status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_VERIFY_USER_FW_STATUS, SFU_STATE_HANDLE_CRITICAL_FAILURE);
#endif /* KMS_ENABLED */
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */
}


#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
/**
  * @brief  Check if a new UserApp firmware is available for downloading.
  *         When entering this state from SFU_STATE_CHECK_STATUS_ON_RESET (initialDeviceStatusCheck=1) it is required
  *         to press the user button to force the local download.
  *         When entering this state from SFU_STATE_VERIFY_USER_FW_STATUS the local download is awaited automatically
  *         (because there is no other action to do).
  * @param  None
  * @note   This function must set the next State Machine State.
  * @retval None
  */
static void SFU_BOOT_SM_CheckNewFwToDownload(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_ERROR;

  if (initialDeviceStatusCheck == 1)
  {
    /* At boot-up, before checking the FW status, a local download can be forced thanks to the user button */
    TRACE("\r\n= [SBOOT] STATE: CHECK NEW FIRMWARE TO DOWNLOAD");
    if (0 != BUTTON_PUSHED())
    {
      /* Download requested */
      e_ret_status = SFU_SUCCESS;
    }
  }
  else
  {
    /*
     * The FW status has already been checked and no FW can be launched: no need to check the trigger, wait for a local
     * download to start
     */
    e_ret_status = SFU_SUCCESS;
  }

#ifdef KMS_ENABLED
  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_DOWNLOAD_NEW_USER_FW, SFU_STATE_CHECK_KMS_BLOB_TO_INSTALL);
#else
  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_DOWNLOAD_NEW_USER_FW, SFU_STATE_VERIFY_USER_FW_STATUS);
#endif /* KMS_ENABLED */

