jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
}
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */

#ifdef KMS_ENABLED
/**
  * @brief  Check if a KMSBlob is waiting for installation.
  *         This state can be entered only from SFU_STATE_CHECK_STATUS_ON_RESET when the local loader feature is
  *         disabled.
  *         This state can be entered only from SFU_STATE_CHECK_NEW_FW_TO_DOWNLOAD when the local loader feature is
  *         enabled.
  *         In this latter case,
  *               if a new Firmware download is requested,
  *               it has priority over the KMS blob installation,
  *               and the KMS blob installation request will be lost.
  * @param  None
  * @note   This function must set the next State Machine State.
  * @retval None
  */
static void SFU_BOOT_SM_CheckKMSBlobToInstall(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_ERROR;
  SFU_KMS_BlobInstallStateTypeDef e_PendingInstallStatus;

  /* At boot-up, before checking the FW status, we must check if a KMS blob installation is pending */
  TRACE("\r\n= [SBOOT] STATE: CHECK KMS BLOB TO INSTALL");

  /* Check if a Blob Installation is requested or on-going */
  e_PendingInstallStatus = SFU_KMS_CheckPendingBlobInstallation();

  if (SFU_KMS_NO_BLOBUPDATE != e_PendingInstallStatus)
  {
    /* Blob installation requested */
    e_ret_status = SFU_SUCCESS;
  }

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_INSTALL_KMS_BLOB, SFU_STATE_VERIFY_USER_FW_STATUS);
}


/**
  * @brief  Check if a KMSBlob is waiting for instal.
  *         When entering this state from SFU_STATE_CHECK_STATUS_ON_RESET (initialDeviceStatusCheck=1) it is required
  *         to press the user button to force the local download.
  *         When entering this state from SFU_STATE_VERIFY_USER_FW_STATUS the local download is awaited automatically
  *         (because there is no other action to do).
  * @param  None
  * @note   This function must set the next State Machine State.
  * @retval None
  */
static void SFU_BOOT_SM_InstallKMSBlob(void)
{
  SFU_ErrorStatus  e_ret_status = SFU_ERROR;
  uint8_t         *pBlobToImport;
  CK_ULONG        ImportBlobResult;
  CK_RV           e_status;

  /* At boot-up, Managing ImportBlob through KMS services.  */
  TRACE("\r\n= [SBOOT] STATE: INSTALL KMS BLOB");

  /* Here we will Launch SE service to take consume the Blob */
  /* When the Service confirms that the Blob is installed, then we can erase the SWAP */
  pBlobToImport = SFU_KMS_GetBlobInstallInfo();

  /* Initialize KMS in order to be able to import blob using internal algorythms */
  e_status = C_Initialize(NULL);
  if (e_status == CKR_OK)
  {
    /* we do not take the return value into account as we will not retry the import in case of issue */
    e_status = SE_KMS_ImportBlob(pBlobToImport, &ImportBlobResult);

    if (e_status != CKR_OK)
    {
      (void)C_Finalize(NULL);
    }
    else
    {
      e_status = C_Finalize(NULL);
    }
  }

  if (e_status != CKR_OK)
  {
    TRACE("\r\n= [SBOOT] INSTALL KMS: ERROR WHEN COMMUNICATING WITH KMS");
  }

  /* In any case, we remove the Blob To Install (regardless of the result) */
  e_ret_status = SFU_KMS_EraseBlob();

  if (e_ret_status != SFU_SUCCESS)
  {
    TRACE("\r\n= [SBOOT] INSTALL KMS: ERROR WHEN ERASING KMS BLOB");
  }

  /* Display the KMS import result */
  switch (ImportBlobResult)
  {
    case KMS_IMPORT_BLOB_FINALIZED:
      TRACE("\r\n= [SBOOT] INSTALL KMS: KMS BLOB WELL INSTALLED");
      e_ret_status = SFU_SUCCESS;
      break;

    case KMS_IMPORT_BLOB_CRYPTO_BLOB_AUTH_ERROR:
      /* At boot-up, Crypto Error when trying to install KMSBlob.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: BLOB AUTHENT ERROR WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_ERROR;
      break;

    case KMS_IMPORT_BLOB_CRYPTO_BLOB_VERIF_ERROR:
      /* At boot-up, Crypto Error when trying to install KMSBlob.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: BLOB VERIF ERROR WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_ERROR;
      break;

    case KMS_IMPORT_BLOB_CRYPTO_BLOB_FORM_ERROR:
      /* At boot-up, Crypto Error when trying to install KMSBlob.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: BLOB FORM ERROR WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_ERROR;
      break;

    case KMS_IMPORT_BLOB_OBJECTID_ERROR:
      /* At boot-up, SlotID Error when trying to install KMSBlob.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: OBJECTID ERROR WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_ERROR;
      break;

    case KMS_IMPORT_BLOB_NVM_WARNING:
      /* At boot-up, NVM Warning when trying to install KMSBlob.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: NVM WARNING WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_SUCCESS;
      break;

    case KMS_IMPORT_BLOB_NVM_ERROR:
      /* At boot-up, NVM Error when trying to install KMSBlob.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: NVM ERROR WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_ERROR;
      break;

    case KMS_IMPORT_BLOB_SESSION_INUSE:
      /* At boot-up, trying to install KMSBlob while KMS is being use.  */
      TRACE("\r\n= [SBOOT] INSTALL KMS: KMS KEYS IN USE WHEN INSTALLING KMS BLOB");
      e_ret_status = SFU_ERROR;
      break;

    default:
      TRACE("\r\n= [SBOOT] INSTALL KMS: UNKNOWN STATUS");
      e_ret_status = SFU_ERROR;
      break;
  }

  /* Set the next State Machine regardless of the KMS import result */
  SFU_SET_SM_CURR_STATE(SFU_STATE_VERIFY_USER_FW_STATUS);
}

#endif /* KMS_ENABLED */



/**
  * @brief  Check the Status of the Fw Image to work on  in order to set the next
  *         State Machine state accordingly
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_CheckUserFwStatus(void)
{
  SFU_IMG_ImgInstallStateTypeDef e_PendingInstallStatus;
  SFU_ErrorStatus e_HasValidFw;

