jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
  if (initialDeviceStatusCheck == 1U)
  {
    TRACE("\r\n= [SBOOT] STATE: CHECK USER FW STATUS");
  }

  /*
   * 2 FW images implementation: the status is computed directly from the FLASH state.
   */

  /* Check if there is a pending action related to a FW update procedure */
  e_PendingInstallStatus = SFU_IMG_CheckPendingInstallation();

  switch (e_PendingInstallStatus)
  {
    case SFU_IMG_FWUPDATE_STOPPED:
      /* The installation of a downloaded FW has been interrupted */
      /* We perform a resume of the installation */
      TRACE("\r\n\t  Installation Failed: resume installation procedure initiated");
      SFU_SET_SM_CURR_STATE(SFU_STATE_RESUME_INSTALL_NEW_USER_FW);
      break;

    case SFU_IMG_FWIMAGE_TO_INSTALL:
#if (SFU_IMAGE_PROGRAMMING_TYPE == SFU_ENCRYPTED_IMAGE)
      /*
       * A new encrypted FW is present in the slot #1 and ready to be installed: to be decrypted and swapped with the
       * active FW
       */
      TRACE("\r\n\t  New Fw Encrypted, to be decrypted");
#elif (SFU_IMAGE_PROGRAMMING_TYPE == SFU_CLEAR_IMAGE)
      /*
       * A new clear FW is present in the slot #1 and ready to be installed: to be reorganized in flash and swapped
       * with the active FW
       */
      TRACE("\r\n\t  New Clear Fw, to be re-ordered in FLASH as expected by the swap procedure");
#else
#error "The current example does not support the selected Firmware Image Programming type."
#endif /* SFU_IMAGE_PROGRAMMING_TYPE == SFU_CLEAR_IMAGE */
      SFU_SET_SM_CURR_STATE(SFU_STATE_INSTALL_NEW_USER_FW);
      break;

    case SFU_IMG_NO_FWUPDATE:
      /*
       * No FW image installation pending:
       * Check if there is a valid active Firmware already installed
       */
      e_HasValidFw = SFU_IMG_HasValidActiveFirmware();

      if (SFU_SUCCESS == e_HasValidFw)
      {
        TRACE("\r\n\t  A valid FW is installed in the active slot - version: %d", SFU_IMG_GetActiveFwVersion());
        /* Even if already verified in the past, the fw has to be verified before being executed */
        SFU_SET_SM_CURR_STATE(SFU_STATE_VERIFY_USER_FW_SIGNATURE);
      }
      else
      {
#ifdef ENABLE_IMAGE_STATE_HANDLING
        /* we could have an interrupted rollback
         * the slot 0 header is valid (with src image fingerprint != 0) and a non valid fw image (the old image partially rolled back)
         * we attempt to continue the rollback
         */
        if( SFU_SUCCESS == SFU_IMG_RollbackFWUpdate() )
        {
          SFU_SET_SM_CURR_STATE(SFU_STATE_REBOOT_STATE_MACHINE);
        }
        else
#endif /* ENABLE_IMAGE_STATE_HANDLING */
        {
          /* Control if slot #0 is empty */
          if (SFU_IMG_VerifyEmptyActiveSlot() != SFU_SUCCESS)
          {
            /*
             * We should never reach this code.
             * Could come from an attack ==> as an example we invalidate current firmware.
             */
            TRACE("\r\n\t  Slot #0 not empty : erasing ...");
            (void)SFU_IMG_InvalidateCurrentFirmware(); /* If this fails we continue anyhow */
          }

          /*
           * No valid FW is present in the active slot
           * and there is no FW to be installed in UserApp download area: local download (when possible)
           */
          if (1U == initialDeviceStatusCheck)
          {
            TRACE("\r\n\t  No valid FW found in the active slot nor new encrypted FW found in the UserApp download area");
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
            /* Waiting for a local download is automatic, no trigger required. */
            TRACE("\r\n\t  Waiting for the local download to start... ");
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */
            initialDeviceStatusCheck = 0U;
#ifdef SFU_TEST_PROTECTION
            SFU_TEST_Reset();
#endif /* SFU_TEST_PROTECTION */
          }
#if defined(SFU_VERBOSE_DEBUG_MODE)
          else
          {
            /*
             * No ELSE branch (except for verbose debug), because the FW status is checked only once per boot:
             *   If a FW is present in the active slot => it is checked then launched.
             *   If there is a FW to install => the installation procedure starts.
             *   If no FW is present and no installation is pending:
             *      - if the local loader feature is enabled we enter the local download state
             *      - if the local loader feature is disabled, the execution is stopped.
             */
            TRACE("Abnormal case: SFU_STATE_VERIFY_USER_FW_STATUS should not be entered more than once per boot.");
          }
#endif /* SFU_VERBOSE_DEBUG_MODE */
#if (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
          SFU_SET_SM_CURR_STATE(SFU_STATE_CHECK_NEW_FW_TO_DOWNLOAD);
          /*
           * In this example, if there is no active FW, we do not try to re-install a backed-up FW from slot #1
           * even if it is available. This could be done to improve the handling of the corrupted FW case.
           * With the current implementation, when the active FW is corrupted we end up in local download state.
           */
#else
          /*
           * When the local loader feature is disabled it is not possible to enter the local download state.
           * Rebooting automatically or keeping on checking the FW status would not necessarily be better.
           * So we end up waiting for the user to reboot (or the IWDG to expire).
           */
          TRACE("No valid FW and no local loader: execution stopped.\r\n");
          while (1)
          {
            BSP_LED_Toggle(SFU_STATUS_LED);
            HAL_Delay(SFU_STOP_NO_FW_BLINK_DELAY);
          }
#endif /* (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER) || (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER) */
        }
      }
      break;

    default:
      TRACE("\r\n\t  Flash State Unknown, Critical failure");
      /* If not in one of the previous state, something bad occurred */
      SFU_SET_SM_CURR_STATE(SFU_STATE_HANDLE_CRITICAL_FAILURE);
      break;
  }
}


#if (SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER)
/**
  * @brief  A new UserApp Fw was available. Start to download it
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_DownloadNewUserFw(void)
{
  uint32_t jump_address ;
  typedef void (*Function_Pointer)(void);
  Function_Pointer  p_jump_to_function;

  TRACE("\r\n= [SBOOT] STATE: DOWNLOAD NEW USER FIRMWARE");

  /* Initialize address to jump */
  jump_address = *(__IO uint32_t *)(((uint32_t)LOADER_REGION_ROM_START + 4));
  p_jump_to_function = (Function_Pointer) jump_address;

  /* Initialize loader's Stack Pointer */
  __set_MSP(*(__IO uint32_t *)(LOADER_REGION_ROM_START));

