jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
  /* Destroy the Volatile data and CSTACK in SRAM used by Secure Boot in order to prevent any access to sensitive data
     from the loader.
     If FWall is used and a Secure Engine CStack context switch is implemented, these data are the data
     outside the protected area, so not so sensitive, but still in this way we add increase the level of security.
  */
  SFU_LL_SB_SRAM_Erase();

  /* Jump into loader */
  p_jump_to_function();

  /* The point below should NOT be reached */
  return;
}
#elif (SECBOOT_LOADER == SECBOOT_USE_LOCAL_LOADER)
/**
  * @brief  A new UserApp Fw was available. Start to download it
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_DownloadNewUserFw(void)
{
  SFU_ErrorStatus           e_ret_status = SFU_ERROR;
  SFU_LOADER_StatusTypeDef  e_ret_status_app = SFU_LOADER_ERR;
  SE_FwRawHeaderTypeDef     x_fw_raw_header;
  SFU_FwImageFlashTypeDef    x_fw_image_flash_data;
  uint32_t u_size = 0;

  TRACE("\r\n= [SBOOT] STATE: DOWNLOAD NEW USER FIRMWARE");

  /*
   * Get the download area parameters.
   * We use the same generic function as the UserApp to avoid maintaining equivalent information.
   * In the current example with 2 images:
   *     x_fw_image_flash_data.DownloadAddr = SFU_IMG_SLOT_1_REGION_BEGIN_VALUE;
   *     x_fw_image_flash_data.MaxSizeInBytes = (uint32_t)SFU_IMG_SLOT_1_REGION_SIZE;
   *     x_fw_image_flash_data.ImageOffsetInBytes = SFU_IMG_IMAGE_OFFSET;
   */
  if (SFU_IMG_GetDownloadAreaInfo(&x_fw_image_flash_data) == SFU_SUCCESS)
  {
    /*
     * Download of the new firmware image : We erase the entire slot 1 to be able to do a local download at any point
     * in time of the device's life.
     */
    e_ret_status = SFU_LOADER_DownloadNewUserFw(&e_ret_status_app, &x_fw_image_flash_data, &u_size);
    if (e_ret_status == SFU_SUCCESS)
    {
      /* Read header in slot 1 */
      SFU_LL_FLASH_Read((void *) &x_fw_raw_header, (uint32_t *) x_fw_image_flash_data.DownloadAddr,
                        sizeof(x_fw_raw_header));

#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  FwSize=%d | PartialFwSize=%d | PartialFwOffset=%d | %d bytes received",
            x_fw_raw_header.FwSize, x_fw_raw_header.PartialFwSize, x_fw_raw_header.PartialFwOffset, u_size);
#endif /* SFU_VERBOSE_DEBUG_MODE */
      /*
       * Notify the Secure Boot that a new image has been downloaded
       * by calling the SE interface function to trigger the installation procedure at next reboot.
       */
      if (SFU_IMG_InstallAtNextReset((uint8_t *) &x_fw_raw_header) != SFU_SUCCESS)
      {
        /* Erase downloaded image */
        (void) SFU_IMG_EraseDownloadedImg();

        /* no specific error cause set */
#if defined(SFU_VERBOSE_DEBUG_MODE)
        TRACE("\r\n\t  Cannot memorize that a new image has been downloaded.");
#endif /* SFU_VERBOSE_DEBUG_MODE */
      }
    }
    else
    {
      /* Erase downloaded image */
      (void) SFU_IMG_EraseDownloadedImg();

      /* Memorize the specific error cause if any before handling this critical failure */
      switch (e_ret_status_app)
      {
        case SFU_LOADER_ERR_COM:
          (void)SFU_BOOT_SetLastExecError(SFU_EXCPT_COM_ERROR);
          break;
        case SFU_LOADER_ERR_DOWNLOAD:
          (void)SFU_BOOT_SetLastExecError(SFU_EXCPT_DOWNLOAD_ERROR);
          break;
        case SFU_LOADER_ERR_CRYPTO:
          (void)SFU_BOOT_SetLastExecError(SFU_EXCPT_DECRYPT_FAILURE);
          break;
        default:
          /* no specific error cause */
          break;
      }
    }
  } /* else error with no specific error cause */
  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_REBOOT_STATE_MACHINE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}
#endif /* SECBOOT_LOADER == SECBOOT_USE_EXTERNAL_LOADER */

/**
  * @brief  Install the new UserApp Fw
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_InstallNewUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  TRACE("\r\n= [SBOOT] STATE: INSTALL NEW USER FIRMWARE ");

  /* Double security check :
     - testing "static protections" twice will avoid basic hardware attack
     - flow control reached : dynamic protections checked
     - re-execute static then dynamic check
     - errors caught by FLOW_CONTROL */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  FLOW_CONTROL_INIT(uFlowProtectValue, FLOW_CTRL_INIT_VALUE);
  SFU_LL_SECU_CheckApplyStaticProtections();
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STATIC_PROTECT);
  SFU_LL_SECU_CheckApplyRuntimeProtections(SFU_SECOND_CONFIGURATION);
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  /* Check the Firmware Header (metadata) */
  e_ret_status = SFU_IMG_CheckCandidateMetadata();

  if (SFU_SUCCESS != e_ret_status)
  {
    /* Erase downloaded FW in case of authentication/integrity error */
    (void) SFU_IMG_EraseDownloadedImg();
  }

  if (SFU_SUCCESS == e_ret_status)
  {
    /* Launch the Firmware Installation procedure */
    e_ret_status = SFU_IMG_TriggerImageInstallation();
  }

  if (SFU_SUCCESS == e_ret_status)
  {
    /*
     * The FW installation succeeded: the previous FW is now backed up in the slot #1.
     * Nothing more to do, in the next FSM state we are going to verify the FW again and execute it if possible.
     */
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n= [FWIMG] FW installation succeeded.");
#endif /* SFU_VERBOSE_DEBUG_MODE */
  }
  else
  {
    /*
     * The FW installation failed: we need to reboot and the resume procedure will be triggered at next boot.
     * Nothing more to do, the next FSM state (HANDLE_CRITICAL_FAILURE) will deal with it.
     */
#if defined(SFU_VERBOSE_DEBUG_MODE)
    TRACE("\r\n= [FWIMG] FW installation failed!");
#endif /* SFU_VERBOSE_DEBUG_MODE */
  }

  /* Set the next State Machine state according to the success or the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_VERIFY_USER_FW_SIGNATURE, SFU_STATE_HANDLE_CRITICAL_FAILURE);
}

/**
  * @brief  Execute a UserApp Fw installation resume
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_ResumeInstallNewUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  TRACE("\r\n= [SBOOT] STATE: RESUME INSTALLATION OF NEW USER FIRMWARE");

