jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
  /*
   * This resume installation procedure continue installation of new User FW in the active slot
   */
  e_ret_status = SFU_IMG_TriggerResumeInstallation();

  /*
   * Set the next State Machine state according to the success or the failure of e_ret_status.
   * No specific error cause managed here because the FSM state already provides the information.
   */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_VERIFY_USER_FW_SIGNATURE, SFU_STATE_HANDLE_CRITICAL_FAILURE);

}

/**
  * @brief  Verify the UserApp Fw signature before executing it
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_VerifyUserFwSignature(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;

  TRACE("\r\n= [SBOOT] STATE: VERIFY USER FW SIGNATURE");

  /* Double security check :
     - testing "static protections" twice will avoid basic hardware attack
     - flow control reached : dynamic protections checked
     - re-execute static then dynamic check
     - errors caught by FLOW_CONTROL */
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);
  FLOW_CONTROL_INIT(uFlowProtectValue, FLOW_CTRL_INIT_VALUE);
  SFU_LL_SECU_CheckApplyStaticProtections();
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_STATIC_PROTECT);
  SFU_LL_SECU_CheckApplyRuntimeProtections(SFU_THIRD_CONFIGURATION);
  FLOW_CONTROL_CHECK(uFlowProtectValue, FLOW_CTRL_RUNTIME_PROTECT);

  /*
   * With the 2 images handling:
   *       1. the active FW is always in slot #0
   *       2. the signature is verified when determining if a FW is installed (see SFU_BOOT_SM_CheckUserFwStatus)
   *       3. the signature is checked when installing a new firmware
   *       4. remaining part of slot #0 is kept "clean" during installation procedure
   * So following checks should never fail.
   */

  /* read the FW header from FLASH and fill the appropriate structure (if the header is authenticated successfully) */
  FLOW_CONTROL_INIT(uFlowCryptoValue, FLOW_CTRL_INIT_VALUE);
  e_ret_status = SFU_IMG_VerifyActiveImgMetadata();

  if (SFU_SUCCESS == e_ret_status)
  {
    /* Check the signature */
    e_ret_status = SFU_IMG_VerifyActiveImg();
  }

  if (SFU_SUCCESS == e_ret_status)
  {
    /* Verify that there is no additional code beyond firmware image */
    e_ret_status = SFU_IMG_VerifyActiveSlot();
  }

  if (SFU_SUCCESS != e_ret_status)
  {
    /*
     * We should never reach this code.
     * Could come from an attack ==> as an example we invalidate current firmware.
     */
    TRACE("\r\n\t  Unexpected code beyond FW image in slot #0: erasing ... ");
    (void)SFU_IMG_InvalidateCurrentFirmware(); /* If this fails we continue anyhow */
  }
  else
  {
    FLOW_CONTROL_CHECK(uFlowCryptoValue, FLOW_CTRL_INTEGRITY);
  }

#ifdef ENABLE_IMAGE_STATE_HANDLING

  if(SFU_SUCCESS == e_ret_status)
  {
    TRACE("\r\n= [SBOOT] CHECKING IMAGE STATE");
    gRollbackDone = 0;
    e_ret_status = SFU_IMG_CheckImageState();
    if (SFU_SUCCESS == e_ret_status)
    {
      TRACE("\r\n= [SBOOT] IMAGE STATE OK");
    }
    else
    {
      TRACE("\r\n= [SBOOT] ERROR: BAD IMAGE STATE");

      if (0 == gRollbackDone)
      {
    	  /* avoid an infinite loop of reboot : local download state will be entered on next boot */
    	  (void)SFU_IMG_InvalidateCurrentFirmware(); /* If this fails we continue anyhow */
      }
      /* else : reboot and check rolled-backed image */
    }
  }
#endif /* ENABLE_IMAGE_STATE_HANDLING */

  /* Set the next State Machine state according to the success of the failure of e_ret_status */
  SFU_SET_SM_IF_CURR_STATE(e_ret_status, SFU_STATE_EXECUTE_USER_FW, SFU_STATE_HANDLE_CRITICAL_FAILURE);

}


/**
  * @brief  Exit from the SB/SFU State Machine and try to execute the UserApp Fw
  * @param  None
  * @note   This function must set the next State Machine State
  * @retval None
  */
static void SFU_BOOT_SM_ExecuteUserFw(void)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  SE_StatusTypeDef e_se_status = SE_KO;

  TRACE("\r\n= [SBOOT] STATE: EXECUTE USER FIRMWARE");

  /* Double security check :
     - Control twice the Header tag will avoid basic hardware attack
     - Control twice the FW tag will avoid basic hardware attack */

  FLOW_CONTROL_INIT(uFlowCryptoValue, FLOW_CTRL_INIT_VALUE);
  if (SFU_IMG_VerifyActiveImgMetadata() != SFU_SUCCESS)
  {
    /* Security issue : execution stopped ! */
    SFU_EXCPT_Security_Error();
  }
  if (SFU_IMG_ControlActiveImgTag() != SFU_SUCCESS)
  {
    /* Security issue : execution stopped ! */
    SFU_EXCPT_Security_Error();
  }

  /*
   * Try to set the last execution status and continue: we assume the UserApp will start or a failure will be linked to
   * the UserApp code so we can change the EXEC_ID now
   */
  SFU_BOOT_SetLastExecStatus(EXEC_ID_USER_APP, m_StateMachineContext.CurrState);

  /*
   * You may decide to implement additional checks before running the Firmware.
   * For the time being we launch the FW present in the active slot.
   *
   * The bootloader must also take care of the security aspects:
   *   A.lock the SE services the UserApp is not allowed to call
   *   B.leave secure boot mode
   */
  /* Lock part of Secure Engine services */
  if (SE_LockRestrictServices(&e_se_status) == SE_SUCCESS)
  {
    /* De-initialize the SB_SFU bootloader before launching the UserApp */
    (void)SFU_BOOT_DeInit(); /* the return value is not checked, we will always try launching the UserApp */

    /* Last flow control : lock service */
    FLOW_CONTROL_STEP(uFlowCryptoValue, FLOW_STEP_LOCK_SERVICE, FLOW_CTRL_LOCK_SERVICE);

    /* This function should not return */
    e_ret_status = SFU_IMG_LaunchActiveImg();

    /* This point should not be reached */
#if defined(SFU_VERBOSE_DEBUG_MODE)
    /* We do not memorize any specific error, the FSM state is already providing the info */
    TRACE("\r\n=         SFU_IMG_LaunchActiveImg() failure!");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    while (1);
  }
  else
  {
    TRACE("\r\n= [FWIMG] SECURE ENGINE CRITICAL FAILURE!");

    /* Set the error before forcing a reboot, don't care of return value as followed by reboot */
    (void)SFU_BOOT_SetLastExecError(SFU_EXCPT_LOCK_SE_SERVICES_ERR);

