jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
    }
  }
  return e_ret_status;
}

/**
  * @brief  Manage the  the last execution status, and take the right actions accordingly
  * @param  uLastExecStatus: 32-bit representing the @ref SFU_BOOT_Private_Macros_Execution_Status
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
static SFU_ErrorStatus  SFU_BOOT_ManageLastExecStatus(uint32_t uLastExecStatus)
{
  SFU_ErrorStatus e_ret_status = SFU_ERROR;
  SE_StatusTypeDef         e_se_status;
  SE_BootInfoTypeDef       x_boot_info;
  uint32_t                 u_last_error;

  if (SE_INFO_ReadBootInfo(&e_se_status, &x_boot_info) == SE_SUCCESS)
  {
#if defined(SFU_VERBOSE_DEBUG_MODE)
    /* Show the last execution state */
    TRACE("\r\n\t  INFO: Last execution status before Reboot was:");
    if (IS_SFU_SM_STATE(SFU_GET_LAST_EXEC_STATE(uLastExecStatus)))
    {
      TRACE(m_aStateMachineStrings[SFU_GET_LAST_EXEC_STATE(uLastExecStatus)]);
    }
    else
    {
      TRACE("Unknown");
    }
#endif /* SFU_VERBOSE_DEBUG_MODE */

    /* Show the last execution error */
    u_last_error = x_boot_info.LastExecError;
    TRACE("\r\n\t  INFO: Last execution detected error was:");
    if (IS_SFU_EXCPT((SFU_EXCPT_IdTypeDef)u_last_error))
    {
      TRACE(m_aErrorStrings[u_last_error]);
    }
    else
    {
      TRACE("Unknown error.");
      u_last_error = SFU_EXCPT_UNKNOWN;
    }

    /* Custom handler of the last error detected at reset */
    if ((SFU_EXCPT_IdTypeDef)u_last_error != SFU_EXCPT_NONE)
    {
      SFU_EXCPT_ResetExceptionHandler((SFU_EXCPT_IdTypeDef)u_last_error);
    }

    /*
     * It's possible to reset the error at this point (because we are in SFU_STATE_CHECK_STATUS_ON_RESET context so no
     * need to memorize the exception further)
     */
    x_boot_info.LastExecError = SFU_EXCPT_NONE;

    /* Update the BootInfo shared area according to the modifications above */
    if (SE_INFO_WriteBootInfo(&e_se_status, &x_boot_info) == SE_SUCCESS)
    {
      e_ret_status = SFU_SUCCESS;
    }
  }

  return e_ret_status;
}



/**
  * @brief  Manage the  the Reset sources, and if the case store the error for the next steps
  * @param  None
  * @retval SFU_ErrorStatus SFU_SUCCESS if successful, SFU_ERROR otherwise.
  */
static SFU_ErrorStatus  SFU_BOOT_ManageResetSources(void)
{
  SFU_ErrorStatus     e_ret_status = SFU_ERROR;
  SFU_RESET_IdTypeDef e_wakeup_source_id = SFU_RESET_UNKNOWN;
  SFU_EXCPT_IdTypeDef e_exception = SFU_EXCPT_NONE;
  SE_BootInfoTypeDef  x_boot_info; /* to retrieve and  update the counter of consecutive errors */
  SE_StatusTypeDef    e_se_status;

  /* Check the wakeup sources */
  SFU_LL_SECU_GetResetSources(&e_wakeup_source_id);
  switch (e_wakeup_source_id)
  {
      /*
       * Please note that the example of reset causes handling below is only a basic example to illustrate the way the
       * RCC_CSR flags can be used to do so.
       * It is based on the behaviors we consider as normal and abnormal for the SB_SFU and UserApp example projects
       * running on a Nucleo HW board.
       * Hence this piece of code must systematically be revisited and tuned for the targeted system (software and
       * hardware expected behaviors must be assessed to tune this code).
       *
       * One may use the "uExecID" parameter to determine if the last exec status was in the SB_SFU context or UserApp
       * context to implement more clever checks in the reset cause handling below.
       */
    case SFU_RESET_FIREWALL:
      TRACE("\r\n\t  WARNING: A Reboot has been triggered by a Firewall reset!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* This event has to be considered as an error to manage */
      e_exception = SFU_EXCPT_FIREWALL_RESET;
      break;

    case SFU_RESET_WDG_RESET:
      TRACE("\r\n\t  WARNING: A Reboot has been triggered by a Watchdog reset!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* This event has to be considered as an error to manage */
      e_exception = SFU_EXCPT_WATCHDOG_RESET;
      break;

    case SFU_RESET_LOW_POWER:
      TRACE("\r\n\t  INFO: A Reboot has been triggered by a LowPower reset!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* In the current implementation this event is not considered as an error to manage.
         But this is strictly related to the final system. If needed to be managed as an error
         please add the right error code in the following src code line */
      e_exception = SFU_EXCPT_NONE;
      break;

    case SFU_RESET_HW_RESET:
      TRACE("\r\n\t  INFO: A Reboot has been triggered by a Hardware reset!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* In the current implementation this event is not considered as an error to manage.
         This is because a Nucleo board offers a RESET button triggering the HW reset.
         But this is strictly related to the final system. If needed to be managed as an error
         please add the right error code in the following src code line */
      e_exception = SFU_EXCPT_NONE;
      break;

    case SFU_RESET_BOR_RESET:
      TRACE("\r\n\t  INFO: A Reboot has been triggered by a BOR reset!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* In the current implementation this event is not considered as an error to manage.
         But this is strictly related to the final system. If needed to be managed as an error
         please add the right error code in the following src code line */
      e_exception = SFU_EXCPT_NONE;
      break;

    case SFU_RESET_SW_RESET:
      TRACE("\r\n\t  INFO: A Reboot has been triggered by a Software reset!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* In the current implementation this event is not considered as an error to manage,
         also because a sw reset is generated when the State Machine forces a Reboot.
         But this is strictly related to the final system. If needed to be managed as an error
         please add the right error code in the following src code line */
      e_exception = SFU_EXCPT_NONE;
      break;

    case SFU_RESET_OB_LOADER:
      TRACE("\r\n\t  WARNING: A Reboot has been triggered by an Option Bytes reload!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* In the current implementation this event is not considered as an error to manage,
         also because an OptionByte loader is called after applying some of the security protections
         (see SFU_CheckApplyStaticProtections).
         But this is strictly related to the final system. If needed to be managed as an error
         please add the right error code in the following src code line.
         Typically we may implement a more clever check where we determine if this OB reset occured only once because
         SB_SFU had to tune the OB initially, or if it occured again after these initial settings. If so, we could
         consider it as an attack. */
      e_exception = SFU_EXCPT_NONE;
      break;

    default:
      TRACE("\r\n\t  WARNING: A Reboot has been triggered by an Unknown reset source!");
      /* WARNING: This might be generated by an attempted attack, a bug or your code!
         Add your code here in order to implement a custom action for this event,
         e.g. trigger a mass erase or take any other  action in order to
         protect your system, or simply discard it if this is expected.
         ...
         ...
      */
      /* In the current implementation this event is not considered as an error to manage.
         But this is strictly related to the final system. If needed to be managed as an error
         please add the right error code in the following src code line */
      e_exception = SFU_EXCPT_NONE;
      break;
  }

