jaydenchoe/SabAI_STM32_AI/aws_iot/STM32CubeExpansion_Cloud_AWS_V2.0.0/Projects/B-L4S5I-IOT01A/Applications/BootLoader_STSAFE/2_Images_SBSFU/SBSFU/App/sfu_boot.c
  if (SE_INFO_ReadBootInfo(&e_se_status, &x_boot_info) != SE_SUCCESS)
  {
    /* This is not supposed to occur because ReadBootInfo is already called before SFU_BOOT_ManageResetSources() is
       entered... */
    TRACE("\r\n\t  BOOT INFO reading Error");
    /* Do nothing more and return an error */
  }
  else
  {
    /* In case an error has been set above, set/overwrite it into the BootInfo */
    if (e_exception != SFU_EXCPT_NONE)
    {
      /* increment number of consecutive boot errors */
      x_boot_info.ConsecutiveBootOnErrorCounter++;
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Consecutive Boot on error counter ++ ");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    }
    else
    {
      /*
       * The reset cause is considered as normal so we reset the counter of consecutive errors
       */
      x_boot_info.ConsecutiveBootOnErrorCounter = 0;
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Consecutive Boot on error counter reset ");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    }

    /* Log the consecutive init counter value in the console */
    TRACE("\r\n\t  Consecutive Boot on error counter = %d ", x_boot_info.ConsecutiveBootOnErrorCounter);

    /* Update BootInfo structure with  consecutive boot counter */
    if (SE_INFO_WriteBootInfo(&e_se_status, &x_boot_info) != SE_SUCCESS)
    {
      TRACE("\r\n\t  BOOT INFO Consecutive Boot on error counter writing error ");
    }
    else
    {
      e_ret_status = SFU_SUCCESS;
#if defined(SFU_VERBOSE_DEBUG_MODE)
      TRACE("\r\n\t  Consecutive Boot on error counter updated ");
#endif /* SFU_VERBOSE_DEBUG_MODE */
    }
  }

  /* Update the last exec error if needed */
  if (e_exception != SFU_EXCPT_NONE)
  {
    if (SFU_BOOT_SetLastExecError((uint32_t)e_exception) != SFU_SUCCESS)
    {
      e_ret_status = SFU_ERROR;
    } /* else keep the previous e_ret_status value */
  } /* else: no need to update it */

  /* Once the reset sources has been managed and a possible error has been set, clear the reset sources */
  SFU_LL_SECU_ClearResetSources();

  return e_ret_status;
}

/**
  * @}
  */

/**
  * @}
  */

/** @defgroup SFU_BOOT_Callback_Functions Callback_Functions
  * @brief Cube HAL callbacks implementation.
  * @{
  */

/**
  * @brief  Implement the Cube_Hal Callback generated on the Tamper IRQ.
  * @param  None
  * @retval None
  */
void SFU_CALLBACK_Antitamper(void)
{
  SFU_BOOT_IrqExceptionHandler(SFU_EXCPT_TAMPERING_FAULT);
}

/**
  * @brief  Implement the Cube_Hal Callback generated on the Memory Fault.
  * @note  After a Memory Fault could not be possible to execute additional code
  * @param  None
  * @retval None
  */
void SFU_CALLBACK_MemoryFault(void)
{
  SFU_BOOT_IrqExceptionHandler(SFU_EXCPT_MEMORY_FAULT);
}

/**
  * @brief  Implement the Cube_Hal Callback generated on Hard Fault.
  * @note   After a Hard Fault could not be possible to execute additional code
  * @param  None
  * @retval None
  */
void SFU_CALLBACK_HardFault(void)
{
  SFU_BOOT_IrqExceptionHandler(SFU_EXCPT_HARD_FAULT);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#undef SFU_BOOT_C


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
